# ===================================================================================================
#                                       BIU N.K.Z Calculator
#                                            Omri Triki
#                                       Bar Ilan University
#                                               2025
# ===================================================================================================


points = {
    "Electrical Engineering": {
        "תשפ״ב": 91.25,
        "תשפ״ג": 92.75,
        "תשפ״ד": 92.75,
        "תשפ״ה": 90.75,
    },

    "Computer Engineering": {
        "תשפ״ב": 88.25,
        "תשפ״ג": 87.75,
        "תשפ״ד": 88.25,
        "תשפ״ה": 88.5,
    },

    "Quantum Engineering": {
        "תשפ״ב": 116.75,
        "תשפ״ג": 114.25,
        "תשפ״ד": 112.5,
        "תשפ״ה": 112,
    },

    "Noiron Engineering": {
        "תשפ״ב": 90.75,
        "תשפ״ג": 90,
        "תשפ״ד": 92,
        "תשפ״ה": 90.5,
    },

    "Bio-medical Engineering": {
        "תשפ״ה": 91.5,
    },

    "Industrial and Data Systems Engineering": {
        "תשפ״ב": 87,
        "תשפ״ג": 86.75,
        "תשפ״ד": 87.25,
        "תשפ״ה": 87.75,
    },

    "Hardware and Chip Design Engineering": {
        "תשפ״ב": 88,
        "תשפ״ג": 86.5,
        "תשפ״ד": 87,
        "תשפ״ה": 87,
    },

    "Data Engineering": {
        "תשפ״ד": 96.5,
        "תשפ״ה": 96.5,
    },

    "Material Engineering": {
        "תשפ״ד": 88.75,
        "תשפ״ה": 91.75,
    },

    "Software Engineering": {
        "תשפ״ד": 93.25,
        "תשפ״ה": 93.75,
    },
}